lkolbly/cmsis-svd/data/Atmel/ATSAMDA0G16A.svd
        <register>
          <name>WAVE</name>
          <description>Waveform Control</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WAVEGEN</name>
              <description>Waveform Generation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>WAVEGENSelect</name>
                <enumeratedValue>
                  <name>NFRQ</name>
                  <description>Normal frequency</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MFRQ</name>
                  <description>Match frequency</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPWM</name>
                  <description>Normal PWM</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSCRITICAL</name>
                  <description>Dual-slope critical</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSBOTTOM</name>
                  <description>Dual-slope with interrupt/event condition when COUNT reaches ZERO</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSBOTH</name>
                  <description>Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSTOP</name>
                  <description>Dual-slope with interrupt/event condition when COUNT reaches TOP</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMP</name>
              <description>Ramp Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>RAMPSelect</name>
                <enumeratedValue>
                  <name>RAMP1</name>
                  <description>RAMP1 operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAMP2A</name>
                  <description>Alternative RAMP2 operation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAMP2</name>
                  <description>RAMP2 operation</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIPEREN</name>
              <description>Circular period Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CICCEN0</name>
              <description>Circular Channel 0 Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CICCEN1</name>
              <description>Circular Channel 1 Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CICCEN2</name>
              <description>Circular Channel 2 Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CICCEN3</name>
              <description>Circular Channel 3 Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POL0</name>
              <description>Channel 0 Polarity</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POL1</name>
              <description>Channel 1 Polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POL2</name>
              <description>Channel 2 Polarity</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POL3</name>
              <description>Channel 3 Polarity</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAP0</name>
              <description>Swap DTI Output Pair 0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAP1</name>
              <description>Swap DTI Output Pair 1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAP2</name>
              <description>Swap DTI Output Pair 2</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAP3</name>
              <description>Swap DTI Output Pair 3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WAVEB</name>
          <description>Waveform Control Buffer</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WAVEGENB</name>
              <description>Waveform Generation Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>WAVEGENBSelect</name>
                <enumeratedValue>
                  <name>NFRQ</name>
                  <description>Normal frequency</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MFRQ</name>
                  <description>Match frequency</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPWM</name>
                  <description>Normal PWM</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSCRITICAL</name>
                  <description>Dual-slope critical</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSBOTTOM</name>
                  <description>Dual-slope with interrupt/event condition when COUNT reaches ZERO</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSBOTH</name>
                  <description>Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSTOP</name>
                  <description>Dual-slope with interrupt/event condition when COUNT reaches TOP</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMPB</name>
              <description>Ramp Mode Buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>RAMPBSelect</name>
                <enumeratedValue>
                  <name>RAMP1</name>
                  <description>RAMP1 operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAMP2A</name>
                  <description>Alternative RAMP2 operation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAMP2</name>
                  <description>RAMP2 operation</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIPERENB</name>
              <description>Circular Period Enable Buffer</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CICCENB0</name>
              <description>Circular Channel 0 Enable Buffer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CICCENB1</name>
              <description>Circular Channel 1 Enable Buffer</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CICCENB2</name>
              <description>Circular Channel 2 Enable Buffer</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CICCENB3</name>
              <description>Circular Channel 3 Enable Buffer</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POLB0</name>
              <description>Channel 0 Polarity Buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POLB1</name>
              <description>Channel 1 Polarity Buffer</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POLB2</name>
              <description>Channel 2 Polarity Buffer</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POLB3</name>
              <description>Channel 3 Polarity Buffer</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAPB0</name>
              <description>Swap DTI Output Pair 0 Buffer</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAPB1</name>
              <description>Swap DTI Output Pair 1 Buffer</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAPB2</name>
              <description>Swap DTI Output Pair 2 Buffer</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAPB3</name>
              <description>Swap DTI Output Pair 3 Buffer</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WEXCTRL</name>
          <description>Waveform Extension Configuration</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OTMX</name>
              <description>Output Matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTIEN0</name>
              <description>Dead-time Insertion Generator 0 Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTIEN1</name>
              <description>Dead-time Insertion Generator 1 Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTIEN2</name>
              <description>Dead-time Insertion Generator 2 Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTIEN3</name>
              <description>Dead-time Insertion Generator 3 Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTLS</name>
              <description>Dead-time Low Side Outputs Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DTHS</name>
              <description>Dead-time High Side Outputs Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
